sim_saudavel_189/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// ************************************************************************* //

application     foamRun;
solver     incompressibleFluid;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         10;
deltaT          1e-5;

writeControl    adjustableRunTime;
writeInterval   0.01;
purgeWrite      0;
writeFormat     binary;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo          0.5;

functions
{
    #include "functions"
    
}
