sim_saudavel_189/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// --- Dimensoes do Bloco ---
xmin #calc "-0.040504 - 0.004";
xmax #calc " 0.038265 + 0.004";

ymin #calc "-0.076289 - 0.007";
ymax #calc " 0.054979 + 0.007";

zmin -0.005;
zmax 0.006;

// --- Tamanho das Células ---
dx 0.005;
dy 0.005;
dz 0.005; 

// Calcular tamanho do bloco
lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
lz #calc "$zmax - $zmin";

// Calcular número de células
xcells #calc "int(round(($lx)/($dx)))";
ycells #calc "int(round(($ly)/($dy)))";
zcells #calc "int(round(($lz)/($dz)))"; 

vertices
(
    ($xmin $ymin $zmin) // 0
    ($xmax $ymin $zmin) // 1
    ($xmax $ymax $zmin) // 2
    ($xmin $ymax $zmin) // 3
    ($xmin $ymin $zmax) // 4
    ($xmax $ymin $zmax) // 5
    ($xmax $ymax $zmax) // 6
    ($xmin $ymax $zmax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (16 29 11) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // AQUI ESTÁ O TRUQUE: 
    // Definimos tudo como 'symmetry' para evitar conflitos de "wall".
    // Isso prepara o terreno para o snappyHexMesh e para os arquivos 0/.
    
    minX { type symmetry; faces ((0 4 7 3)); }
    maxX { type symmetry; faces ((1 5 6 2)); }
    minY { type symmetry; faces ((0 1 5 4)); }
    maxY { type symmetry; faces ((3 2 6 7)); }
    
    // Frente e verso do bloco de fundo também como symmetry
    minZ { type symmetry; faces ((0 3 2 1)); } 
    maxZ { type symmetry; faces ((4 5 6 7)); } 
);

mergePatchPairs
(
);

// ************************************************************************* //
