sim_saudavel_189/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// ************************************************************************* //

castellatedMesh true;
snap            true;
addLayers       true; 

geometry
{
    inletGeo
    {
        type triSurfaceMesh;
        file "inlet.stl";  
    }

    outletGeo
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }

    wallsGeo
    {
        type triSurfaceMesh;
        file "walls.stl";
    }

    front_and_backGeo
    {
        type triSurfaceMesh;
        file "front_and_back.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;

    features (); 

    refinementSurfaces
    {
        inletGeo 
        {
            level (3 3); 
            patchInfo { type patch; } 
        }
        outletGeo 
        {
            level (3 3);
            patchInfo { type patch; } 
        }
        wallsGeo 
        {
            level (4 4); 
            patchInfo { type wall; } 
        }
        
        front_and_backGeo 
        {
            level (2 2);
            patchInfo 
            { 
                type symmetry; 
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        internalRefine
        {
            mode inside;
            // Mantido no Nível 3 para malha de fundo
            levels ((1E15 3)); 
            centre (0.0 0.0 0.001); 
            radius 0.5; 
        }

        criticalBoxRefine
        {
            mode inside;
            levels ((1.0 4)); // Nível 4: refinamento fino

            box
            {
                // Mínimo: Centro - 0.007m
                min (-0.003746 - 0.007  -0.005);
                // Máximo: Centro + 0.007m
                max (-0.003746 + 0.007   0.006);
            }
        }
    }

    locationInMesh (0.0 0.0 0.001); 
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 100; 
    nRelaxIter 10;
}

addLayersControls
{
    relativeSizes       true;

    layers
    {
        "wallsGeo.*"
        {
            nSurfaceLayers 5; 
        }
    }

    expansionRatio      1.05; 
    finalLayerThickness     0.001; 
    minThickness        0.00022; 
    nGrow               0; 

    featureAngle        60;
    slipFeatureAngle    30;
    minMedianAxisAngle  90;

    nRelaxIter          5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    nSmoothDisplacement 90;

    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;
    maxFaceAspectRatio          0.5;

    nBufferCellsNoExtrude   1;
    nLayerIter          80;
}

meshQualityControls
{
    #includeEtc "caseDicts/mesh/generation/meshQualityDict"
    
    minDeterminant 0.01; 
    maxSkewness 3.0; 
    maxNonOrtho 40; 
    maxInternalFaces 5;
}

mergeTolerance 1e-6;

// ************************************************************************* //
