sim_saudavel_189/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletGeo  // <-- CORRIGIDO
    {
        type            zeroGradient; // Condição padrão para pressão em entradas com velocidade definida
    }

    outletGeo  // <-- CORRIGIDO
    {
        type            fixedValue;   // Define uma pressão de referência (relativa) na saída
        value           uniform 0;
    }

    wallsGeo  // <-- CORRIGIDO
    {
        type            zeroGradient; // Condição padrão para paredes
    }

    front_and_backGeo
    {
        type            symmetry;
    }

    "(minX|maxX|minY|maxY|minZ|maxZ)"
    {
        type            symmetry;
    }

}


// ************************************************************************* //