sim_saudavel_189/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inletGeo
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outletGeo
    {
        type            zeroGradient;
    }
    wallsGeo
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    front_and_backGeo
    {
        type            symmetry;
    }

    "(minX|maxX|minY|maxY|minZ|maxZ)"
    {
        type            symmetry;
    }

}


// ************************************************************************* //
