sim_saudavel_189/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletGeo
    {
        type            fixedValue;
        value           uniform 0;
    }

    outletGeo
    {
        type            zeroGradient;
    }

    wallsGeo
    {
        type            zeroGradient;
    }
    front_and_backGeo
    {
        type            symmetry;
    }

    "(minX|maxX|minY|maxY|minZ|maxZ)"
    {
        type            symmetry;
    }

}
}

// ************************************************************************* //
