sim_saudavel_189/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 100; // Valor inicial estimado

boundaryField
{
    inletGeo
    {
        // Frequência de turbulência na entrada
        type            fixedValue;
        value           uniform 50; 
    }

    outletGeo
    {
        type            zeroGradient;
    }

    wallsGeo
    {
        // Condição de parede essencial para o modelo kOmegaSST
        type            omegaWallFunction;
        value           uniform 50;
    }

    // --- CRUCIAL PARA 2D ---
    front_and_backGeo
    {
        type            symmetry;
    }

    "(minX|maxX|minY|maxY|minZ|maxZ)"
    {
        type            symmetry;
    }

}

// ************************************************************************* //