sim_saudavel_189/0/one
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      one;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inletGeo
    {
        type            calculated;
        value           uniform 1;
    }
    outletGeo
    {
        type            calculated;
        value           uniform 1;
    }
    wallsGeo
    {
        type            calculated;
        value           uniform 1;
    }
    front_and_backGeo
    {
        type            symmetry;
    }

    "(minX|maxX|minY|maxY|minZ|maxZ)"
    {
        type            symmetry;
    }

}

