sim_saudavel_189/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    
    // MUDANÇA CRUCIAL: De 'Gauss linearUpwind grad(U)' para 'Gauss upwind'
    div(phi,U)      Gauss upwind; 
    
    div(phi,k)      Gauss upwind;
    div(phi,omega)  Gauss upwind;
    
    div(phi,epsilon) Gauss upwind;
    div(phi,R)       Gauss upwind;
    div(phi,nuTilda) Gauss upwind;
    
    // Mantenha o resto
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //