sim_saudavel_189/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    // ADICIONADO: 'omega' na lista de campos
    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    // ADICIONADO: 'omega' na lista Final
    "(U|k|epsilon|omega)Final"
    {
        // Copiei os valores de cima explicitamente para evitar erro de variável $U não encontrada
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 2;
    nCorrectors         2;
    
    // REMOVIDO: Não use pRef se houver fixedValue p no outlet
    // pRefPoint (0.019881 0.048903 0.029943); 
    // pRefValue 0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.3; // Era 0.7 -> Reduza para 0.3
        k               0.3; // Era 0.5 -> Reduza para 0.3
        omega           0.3; // Era 0.5 -> Reduza para 0.3
    }
}
// ************************************************************************* //